---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ColorWithTransparency)
source: html/75b056bc-5893-d9a8-0fc5-89c52d79cfab.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.#ctor Method

Constructs the vertex from a point and a color.

## Syntax (C#)
```csharp
public VertexPositionColored(
	XYZ position,
	ColorWithTransparency color
)
```

## Parameters
- **position** (`Autodesk.Revit.DB.XYZ`) - The vertex's position.
- **color** (`Autodesk.Revit.DB.ColorWithTransparency`) - The vertex's color.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null